# Core tools
brew "mise"
brew "starship"
brew "gh"
brew "git-lfs"
brew "neovim"
brew "tmux"
brew "fzf"
brew "jq"
brew "btop"
brew "coreutils"
brew "wget"

# Languages & package managers
brew "node"
brew "pipx"
brew "poetry"
brew "yarn"
brew "pnpm"

# Infrastructure
brew "hashicorp/tap/terraform"
brew "k9s"
brew "rclone"

# Security
brew "nmap"
brew "yara"
brew "socat"

# Casks
cask "1password-cli"
